src/Catalogs/am_Бренды/am_Бренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>am_Бренды</name>
  <attributes>
    <name>Качество</name>
    <type>
      <types>EnumRef.am_КачествоТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Диапазон</name>
    <attributes>
      <name>От</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>До</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="26f5bd34-55fb-4583-a708-4a1aa18f4701">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="55a3f7e4-3de3-47d1-ae22-29cc117b567d">
    <name>Запас</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="78c63ce8-4298-4ddf-bdaa-d93bd267293a">
    <name>ПодарочныйСертификат</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb571f86-1462-437b-9ebb-1df93b741d6b">
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3bf04f5c-0e2b-4597-b5ce-59a845276b86">
    <name>Операция</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a65eacc7-20b4-4874-a8df-eeb4c78616c5">
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6c7cb4e5-139e-4bc4-a35f-e6efc2523fec">
    <name>ВидРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/am_Бренды/ManagerModule.bsl
&НаСервере
Процедура СоздатьБрендПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Бренды.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.am_Бренды КАК Бренды";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		
		Бренд = Справочники.am_Бренды.СоздатьЭлемент();
		Бренд.Наименование = "<Без бренда>";
		Бренд.Записать();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура.ТипНоменклатуры = &ТипНоменклатуры";
	Запрос.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Запас);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрН = Выборка.Ссылка.ПолучитьОбъект();
		Если НЕ ЗначениеЗаполнено(СпрН.am_Бренд) Тогда
			СпрН.am_Бренд = Справочники.am_Бренды.НайтиПоНаименованию("<Без бренда>");
			СпрН.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
